
&НаКлиенте
Процедура МестаРаботыДатаОкончанияРаботыПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.МестаРаботы.ТекущиеДанные;
	
	Если Не ЗначениеЗаполнено(ТекущаяСтрока.ДатаНачалаРаботы) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ТекущаяСтрока.ДатаОкончанияРаботы <= ТекущаяСтрока.ДатаНачалаРаботы Тогда
		
		Сообщить("Дата окончания не может быть равной или меньшей даты начала. Введите новую дату!");
		
		ТекущаяСтрока.ДатаОкончанияРаботы = Дата("00010101");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МестаРаботыДатаНачалаРаботыПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.МестаРаботы.ТекущиеДанные;
	
	Если Не ЗначениеЗаполнено(ТекущаяСтрока.ДатаОкончанияРаботы) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ТекущаяСтрока.ДатаОкончанияРаботы <= ТекущаяСтрока.ДатаНачалаРаботы Тогда
		
		Сообщить("Дата начала не может быть равной или меньшей даты окончания. Введите новую дату!");
		
		ТекущаяСтрока.ДатаНачалаРаботы = Дата("00010101");
		
	КонецЕсли;
	
КонецПроцедуры
 
&НаКлиенте
Процедура ДатаРожденияПриИзменении(Элемент)
	Возраст = ПолучитьВозрастНаТекущуюДату(ДатаРождения); 
КонецПроцедуры

&НаКлиенте
Функция ПолучитьВозрастНаТекущуюДату(ДатаРождения)
	
	ДатаСегодня = ТекущаяДата();
	
	ТекущийГод = Год(ДатаСегодня);
	ГодРождения = Год(ДатаРождения);
	
	КоличествоЛет = ТекущийГод - ГодРождения;
	
	ДеньРожденияВЭтомГоду = Дата(ТекущийГод, Месяц(ДатаРождения), День(ДатаРождения));
	
	Если НачалоДня(ДатаСегодня) < НачалоДня(ДеньРожденияВЭтомГоду) Тогда
	
		КоличествоЛет = КоличествоЛет - 1;
	
	КонецЕсли;
	
	Возврат КоличествоЛет;

КонецФункции // ПолучитьВозрастНаТекущуюДату()

&НаКлиенте
Процедура НаличиеДетейПриИзменении(Элемент)
	Элементы.КоличествоДетей.Видимость = НаличиеДетей;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.КоличествоДетей.Видимость = НаличиеДетей;
	Элементы.МестаРаботы.Видимость = Не ЭтоПервоеМестоРаботы;
КонецПроцедуры

&НаКлиенте
Процедура ПерваяРаботаПриИзменении(Элемент)
	Элементы.МестаРаботы.Видимость = Не ЭтоПервоеМестоРаботы;
КонецПроцедуры
